{
  "cases": [
    {
      "title": "Plus Package",
      "platform": "Web",
      "tech": "/web/vanilla",
      "date": "Winter 2018",
      "colors": [
        "#3fffb5",
        "#2e2d4d",
        "#E6E6E6"
      ],
      "icon": "plus_package_icon.png",
      "coverImage": "plus_package_cover.png",
      "primaryImage": "plus_package_cover.png",
      "secondaryImage": "plus_package_preview.png",
      "previewImage": "plus_package_preview.png",
      "productImages": [
        {
          "source": "plus_package_landing.png", "type": "web"},
        {
          "source": "plus_package_page_1.png", "type": "web"},
        {
          "source": "plus_package_page_2.png", "type": "web"},
        {
          "source": "plus_package_icon_iterations.png", "type": "square"},
        {
          "source": "plus_package_sticker.png", "type": "square"}
      ],
      "introduction": "Plus Package sells individual snacks and drinks at bulk prices to college students, to help keep food prices down.",
      "body": [
        {
          "title": "Purpose",
          "text": "As college students, we found that our on-campus dining options were just too expensive. And if we wanted our favorite foods at reasonable prices, we’d have to buy in such large quantities that we just ended up throwing food away. Every student deserves access to everyday food at affordable prices, so we decided to do something about it."
        },
        {
          "title": "Plan",
          "text": "Through our website, users can buy individual items from a bulk package at bulk prices (i.e. $1.50 for five cans of seltzer out of a case of 24). At the end of the week, if every item in that package has been reserved by a user, we’ll buy it and distribute the individual items to our users."
        }
      ],
      "link": "https://www.pluspackage.io"
    },
    {
      "title": "LANDR Co.",
      "platform": "Mobile",
      "tech": "/mobile/iOS/swift/spritekit",
      "date": "Winter 2018",
      "colors": [
        "#AA4444",
        "#AA9944",
        "#AAAA99"
      ],
      "icon": "landr_icon.png",
      "coverImage": "landr_cover.png",
      "primaryImage": "landr_primary.png",
      "secondaryImage": "landr_preview.png",
      "previewImage": "landr_preview.png",
      "productImages": [
        {
          "source": "landr_1.png", "type": "mobile"},
        {
          "source": "landr_2.png", "type": "mobile"},
        {
          "source": "landr_3.png", "type": "mobile"},
        {
          "source": "landr_4.png", "type": "mobile"}
      ],
      "introduction": "Lift off in Landr as a spaceship navigating an asteroid belt while managing fuel consumption, mining for cash, and shooting lasers.",
      "body":[
        {
          "title": "Making Landr",
          "text": "Landr was born in an all-night programming session and finished in less than a week. It was built in Swift using the SpriteKit framework and is fully featured with upgrades, lasers, achievements, cash, and cool effects. The two components that were hardest to make: an algorithm for drawing cool asteroids and having horizontal movement keep pace with velocity."
        }
      ],
      "link": "https://www.pluspackage.io"
    },
    {
      "title": "Tileform",
      "platform": "Mobile",
      "tech": "/mobile/cross-platform/unity/",
      "date": "Fall 2018",
      "colors": [
        "#AA4444",
        "#AA9944",
        "#AAAA99"
      ],
      "icon": "tileform_icon.png",
      "primaryImage": "primary.png",
      "secondaryImage": "secondary.png",
      "logo": "",
      "productImages": [
        {
          "source": "first.png"},
        {
          "source": "second.png"},
        {
          "source": "third.png"},
        {
          "source": "fourth.png"}
      ],
      "introduction": "Tileform is a simple puzzle game that challenges you to flip all tiles to a single color by tapping a few buttons.",
      "body": [
        {
          "title": "How To Play",
          "text": "We love puzzles. Math puzzles, puzzle games, actual piece-by-piece puzzles, you name it. Yet we struggled to find a fun puzzle game on the App Store that was original, challenging, and not overrun by advertisements, so we decided to make our own. To play Tileform, you press one of 3 or so buttons on the screen and some of the tiles on the screen will change colors or move. All you have to do is press the right buttons in the proper order to make all of the tiles become the same color."
        },
        {
          "title": "Making Tileform",
          "text": "Tileform (codename: Project Rhinoceros) was our first project in Unity, our first time coding in C#, and our first project released on Android. Besides just making the app, we also built a internal web page for creating new puzzles where we could design levels from the ground up, calculate how many moves it would take to solve them, and export them into our app."
        }
      ],
      "link": "https://www.pluspackage.io"
    },
    {
      "title": "Polarity - the game",
      "platform": "Mobile",
      "tech": "/mobile/iOS/swift/spritekit",
      "date": "Summer 2017",
      "colors": [
        "#231F20",
        "#202859",
        "#EC2024",
        "#3BB44A",
        "#AA529E",
        "#29A9E1",
        "#FDCE13"
      ],
      "icon": "polarity_icon.png",
      "coverImage": "polarity_cover.png",
      "primaryImage": "polarity_full.png",
      "secondaryImage": "polarity_preview.png",
      "previewImage": "polarity_preview.png",
      "productImages": [
        {
          "source": "polarity_1.png", "type": "mobile"},
        {
          "source": "polarity_2.png", "type": "mobile"},
        {
          "source": "polarity_3.png", "type": "mobile"},
        {
          "source": "polarity_4.png", "type": "mobile"},
        {
          "source": "polarity_5.png", "type": "square"},
        {
          "source": "polarity_6.png", "type": "square"}
      ],
      "introduction": "What is up? What is Down? Feel the rush of reality as you warp through this neo-fantasy pixel block thrill ride. Wind in your hair as the cyber world spins past you - find upgrades in the forest of towering obstacles seeking to cause destruction. Adrenaline fueled and full of surprises this game will leave you gasping for more.",
      "body": [{
        "title": "Making Polarity",
        "text": "Polarity was one of the first games we made, and as such had a substantial learning curve. We went through multiple iterations on pretty much every part of the game: design and aesthetic changed multiple times, our procedural generation had to be completely rebuilt twice, and the store and power-up system were being tweaked the entire time. At the end of the day, what we kept coming back to was this idea of ‘simplicity.’ We wanted a game that was challenging and replayable without being complex and could be portrayed through visuals that were clean and modern."
      }],
      "link": "https://www.pluspackage.io"
    }
  ]
}